app/views/static_pages/up_post.html.erb

   <div class="col-md-8">
		<% if current_user.posts.any? %>
			<h3>Microposts (<%= current_user.posts.count %>)</h3>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]