app/views/comments/_comment.html.erb

    <span class="timestamp">
      Posted <%= comment.created_at %>
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "good product"], ["user_id", 3], ["post_id", 1], ["created_at", "2022-05-25 16:39:47.762655"], ["updated_at", "2022-05-25 16:39:47.762655"]]