app/views/comments/destroy.js.erb

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
$('.destroy-comment').bind('ajax:success', function() {
   $(this).closest('li').fadeOut();
});