app/views/users/show.html.erb

SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 4]]
---
	    <%= @user.name %>
	    <span><%= pluralize(current_user.posts.count, "post") %></span>

SELECT 1 AS one FROM "posts" WHERE "posts"."user_id" = ? LIMIT ?  [["user_id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  	<%= render 'follow_form' if user_signed_in? %>
		<% if @user.posts.any? %>
			<h3>Microposts (<%= @user.posts.count %>)</h3>