app/views/posts/_post.html.erb

  </span>
  <b> Likes:<%= post.likes.count %> Comments:<%= post.comments.count %> </b>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]