app/views/posts/show.html.erb

<div>
	<b> Likes:<%= @post.likes.count %> Comments:<%= @post.comments.count %> </b>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]

<span>
	<% like = current_user.likes.find_by(post: @post) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 3], ["post_id", 1], ["LIMIT", 1]]

	<b> Comments </b>
	<% if @post.comments.count != 0 %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ? ORDER BY "comments"."created_at" DESC  [["post_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]