app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "good product"], ["user_id", 3], ["post_id", 1], ["created_at", "2022-05-25 16:39:47.762655"], ["updated_at", "2022-05-25 16:39:47.762655"]]
---
  def create
    @current_post = Post.find(params[:post_id])
    @comment = @current_post.comments.build(comment_params)
    @comment.user = current_user
    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ? AND "comments"."id" = ? ORDER BY "comments"."created_at" DESC LIMIT ?  [["user_id", 3], ["id", 1], ["LIMIT", 1]]
---
  def correct_user
    @comment = current_user.comments.find_by(id: params[:id])