app/controllers/likes_controller.rb

  def create
    @like = current_user.likes.new(like_params)
    if @like.save
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["post_id", 1], ["created_at", "2022-05-25 16:37:02.627575"], ["updated_at", "2022-05-25 16:37:02.627575"]]