app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])

INSERT INTO "posts" ("title", "content", "kind", "user_id", "created_at", "updated_at", "price") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = current_user.posts.build(post_params)
    @post.image.attach(params[:post][:image])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 3], ["id", 2], ["LIMIT", 1]]
---
    def correct_user
      @post = current_user.posts.find_by(id: params[:id])