app/controllers/static_pages_controller.rb

SELECT "posts".* FROM "posts" WHERE (user_id = 3) ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def home
    if user_signed_in?
      @feed_items = current_user.feed.paginate(page: params[:page])
      @posts = Post.all.paginate(page: params[:page])

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 3], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 3]]
---
  def up_post
    if user_signed_in?
      @post = current_user.posts.build
      @posts = current_user.posts.paginate(page: params[:page])

SELECT "posts".* FROM "posts" WHERE "posts"."kind" = ? ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["kind", "electronice device"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."kind" = ?  [["kind", "ed"]]
---
  def filter
    field = params[:field]
    @posts = Post.where(:kind => field).paginate(page: params[:page])

SELECT "posts".* FROM "posts" WHERE (title LIKE '%Ip%') ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE (title LIKE '%Ip%')
---
  def search
    keyword = params[:keyword]
    @posts = Post.where('title LIKE ?', "%" + keyword + "%").paginate(page: params[:page])